<?php 
session_start();

//クリックジャッキング対策
header('X-FRAME-OPTIONS: DENY');

if(isset($_POST['check']) && !empty($_POST)) {
  if($_POST['name'] == '') {
    $error['name'] = 'blank';
  }
  if($_POST['email'] == '') {
    $error['email'] = 'blank';
  }
  if($_POST['message'] == '') {
    $error['message'] = 'blank';
  }

  if(empty($error)) {
    $_SESSION['send'] = $_POST;
    $token = bin2hex(random_bytes(32));   //トークン生成
    $_SESSION["token"] = $token;
    header('Location: checkContact.php');
    exit();
  }
}

if(isset($_REQUEST['action']) && $_REQUEST['action'] == 'rewrite') {
  $_POST = $_SESSION['send'];
  $error['rewrite'] = true;
}

function h($str) {
  return htmlspecialchars($str, ENT_QUOTES);
}
?>

<!DOCTYPE html>
<html lang="ja">
<head>
  <meta charset="UTF-8">
  <meta name="viewport" content="width=device-width, initial-scale=1.0">
  <title>TAKUYA OKUDA PORTFOLIO</title>
  <meta name="description" content="TAKUYA OKUDA PORTFOLIO">

  <!-- CSS -->
  <link rel = "stylesheet" href = "https://unpkg.com/ress/dist/ress.min.css">
  <link rel="stylesheet" href="css/style.css">
  <link rel="icon" href="img/favicon.ico">
</head>
<body>
  <!-- header -->
  <header class="header">
    <div class="inner">
      <h1 class="header-logo">
        <a href="#">TAKUYA OKUDA</a>
      </h1>
      <div class="nav-wrapper">
        <nav class="header-nav">
          <ul class="nav-list">
            <li class="nav-item"><a href="#works">WORKS</a></li>
            <li class="nav-item"><a href="#skill">SKILLS</a></li>
            <li class="nav-item"><a href="#about">ABOUT</a></li>
            <li class="nav-item"><a href="#contact">CONTACT</a></li>
          </ul>
        </nav>
      </div>
      <div class="burger-btn"><!-- ハンバーガーボタン -->
        <span class="bar bar_top"></span>
        <span class="bar bar_mid"></span>
        <span class="bar bar_bottom"></span>
      </div>
    </div>
    </header>
  <!-- /header -->

  <!-- main-visual -->
  <div class="big-bg">
    <div class="main-visual">
      <p class="main-visual-title">TAKUYA OKUDA</p>
      <p class="main-visual-subtitle">PORTFOLIO</p>
    </div>
  </div>
  <!-- /main-visual -->

  <!-- works -->
  <div class="works wrapper" id="works">
    <h2 class="title fade-in">WORKS</h2>
    <div class="works-list">
      <div class="works-outline" id="row-space">
        <div class="works-item fade-in">
          <a href="works/cresta/cresta.html" target="_blank" rel="noopener noreferrer">
            <div class="works-img">
              <img src="img/CrestaDesign.png">
            </div>
            <p class="works-name">架空デザインサイト(HTML, CSS)</p>
          </a>
          <a class="source" href="https://github.com/okuda1506/portfolio/tree/main/works/cresta" target="_blank" rel="noopener noreferrer">
            <p class="source-text">ソースコード <img src="https://cdn.jsdelivr.net/gh/devicons/devicon/icons/github/github-original.svg" width="14px" height="14px"/></p>
          </a>
        </div>
        <div class="works-item fade-in">
          <a href="works/wcb/wcb.html" target="_blank" rel="noopener noreferrer">
            <div class="works-img">
              <img src="img/WCB-CAFE.png">
            </div>
            <p class="works-name">架空カフェサイト(HTML, CSS)</p>
          </a>
          <a class="source" href="https://github.com/okuda1506/portfolio/tree/main/works/wcb" target="_blank" rel="noopener noreferrer">
            <p class="source-text">ソースコード <img src="https://cdn.jsdelivr.net/gh/devicons/devicon/icons/github/github-original.svg" width="14px" height="14px"/></p>
          </a>
        </div>
      </div>
      <div class="works-outline" id="row-space">
        <div class="works-item fade-in">
          <a href="works/corporate/corporate.html" target="_blank" rel="noopener noreferrer">
            <div class="works-img">
              <img src="img/corporate.png">
            </div>
            <p class="works-name">架空コーポレートサイト(HTML, CSS, JavaScript)</p>   
          </a>
          <a class="source" href="https://github.com/okuda1506/portfolio/tree/main/works/corporate" target="_blank" rel="noopener noreferrer">
            <p class="source-text">ソースコード <img src="https://cdn.jsdelivr.net/gh/devicons/devicon/icons/github/github-original.svg" width="14px" height="14px"/></p>
          </a>
        </div>
        <div class="works-item fade-in">
          <a href="works/bulletinBoard/post/index.php" target="_blank" rel="noopener noreferrer">
            <div class="works-img">
              <img src="img/bulletinboard.png">
            </div>
            <p class="works-name">ひとこと掲示板サイト(PHP, MySQL)</p>
          </a>
          <a class="source" href="https://github.com/okuda1506/portfolio/tree/main/works/bulletinBoard" target="_blank" rel="noopener noreferrer">
            <p class="source-text">ソースコード <img src="https://cdn.jsdelivr.net/gh/devicons/devicon/icons/github/github-original.svg" width="14px" height="14px"/></p>
          </a>
        </div>
      </div>
      <div class="works-outline">
        <div class="works-item fade-in">
          <a href="index.php" target="_blank" rel="noopener noreferrer">
            <div class="works-img">
              <img src="img/portfolio.png">
            </div>
            <p class="works-name">ポートフォリオ(PHP, jQuery)</p>   
          </a>
          <a class="source" href="https://github.com/okuda1506/portfolio" target="_blank" rel="noopener noreferrer">
            <p class="source-text">ソースコード <img src="https://cdn.jsdelivr.net/gh/devicons/devicon/icons/github/github-original.svg" width="14px" height="14px"/></p>
          </a>
        </div>
        <div class="works-item fade-in">
          <a href="https://twitter.com/VirtualTakuya" target="_blank" rel="noopener noreferrer">
            <div class="works-img">
              <img src="img/weatherTweetBot.png">
            </div>
            <p class="works-name">天気予報Bot(PHP, TwitterAPI, 気象庁API)</p>   
          </a>
          <a class="source" href="https://github.com/okuda1506/weatherTweetBot" target="_blank" rel="noopener noreferrer">
            <p class="source-text">ソースコード <img src="https://cdn.jsdelivr.net/gh/devicons/devicon/icons/github/github-original.svg" width="14px" height="14px"/></p>
          </a>
        </div>
      </div>
    </div>
  </div>
  <!-- /works -->

  <!-- skill -->
  <div class="skill wrapper" id="skill">
    <h2 class="title fade-in">SKILLS</h2>
    <div class="skill-container">
      <div class="skill-item fade-in">
        <p class="skill-img"><svg viewBox="0 0 128 128" width="70px" height="70px">
          <path fill="#E44D26" d="M9.032 2l10.005 112.093 44.896 12.401 45.02-12.387 10.015-112.107h-109.936zm89.126 26.539l-.627 7.172-.276 3.289h-52.665000000000006l1.257 14h50.156000000000006l-.336 3.471-3.233 36.119-.238 2.27-28.196 7.749v.002l-.034.018-28.177-7.423-1.913-21.206h13.815000000000001l.979 10.919 15.287 4.081h.043v-.546l15.355-3.875 1.604-17.579h-47.698l-3.383-38.117-.329-3.883h68.939l-.33 3.539z"></path>
          </svg>
        </p>
        <div class="skill-body">
          <h3 class="skill-name">HTML5 / CSS3</h3>
          <p class="skill-text">
            基本的なマークアップや、レスポンシブ対応を含めたスタイリングは問題なくこなせます。
          </p>
        </div>
      </div>
      <div class="skill-item fade-in">
        <p class="skill-img"><svg viewBox="0 0 128 128" width="70px" height="70px">
          <path fill="#F0DB4F" d="M2 1v125h125v-125h-125zm66.119 106.513c-1.845 3.749-5.367 6.212-9.448 7.401-6.271 1.44-12.269.619-16.731-2.059-2.986-1.832-5.318-4.652-6.901-7.901l9.52-5.83c.083.035.333.487.667 1.071 1.214 2.034 2.261 3.474 4.319 4.485 2.022.69 6.461 1.131 8.175-2.427 1.047-1.81.714-7.628.714-14.065-.001-10.115.046-20.188.046-30.188h11.709c0 11 .06 21.418 0 32.152.025 6.58.596 12.446-2.07 17.361zm48.574-3.308c-4.07 13.922-26.762 14.374-35.83 5.176-1.916-2.165-3.117-3.296-4.26-5.795 4.819-2.772 4.819-2.772 9.508-5.485 2.547 3.915 4.902 6.068 9.139 6.949 5.748.702 11.531-1.273 10.234-7.378-1.333-4.986-11.77-6.199-18.873-11.531-7.211-4.843-8.901-16.611-2.975-23.335 1.975-2.487 5.343-4.343 8.877-5.235l3.688-.477c7.081-.143 11.507 1.727 14.756 5.355.904.916 1.642 1.904 3.022 4.045-3.772 2.404-3.76 2.381-9.163 5.879-1.154-2.486-3.069-4.046-5.093-4.724-3.142-.952-7.104.083-7.926 3.403-.285 1.023-.226 1.975.227 3.665 1.273 2.903 5.545 4.165 9.377 5.926 11.031 4.474 14.756 9.271 15.672 14.981.882 4.916-.213 8.105-.38 8.581z"></path>
          </svg>
        </p>
        <div class="skill-body">
          <h3 class="skill-name">JavaScript</h3>
          <p class="skill-text">
            基本的な文法については習得しています。また、jQueryを使用したアニメーションの実装や、Chartist.jsでの円グラフや棒グラフ等の作成が可能です。
          </p>
        </div>
      </div>
    </div> 

    <div class="skill-container">
      <div class="skill-item fade-in">
        <p class="skill-img"><svg viewBox="0 0 128 128" width="70px" height="70px">
          <path fill="#6181B6" d="M64 33.039C30.26 33.039 2.906 46.901 2.906 64S30.26 94.961 64 94.961 125.094 81.099 125.094 64 97.74 33.039 64 33.039zM48.103 70.032c-1.458 1.364-3.077 1.927-4.86 2.507-1.783.581-4.052.461-6.811.461h-6.253l-1.733 10h-7.301l6.515-34H41.7c4.224 0 7.305 1.215 9.242 3.432 1.937 2.217 2.519 5.364 1.747 9.337-.319 1.637-.856 3.159-1.614 4.515a15.118 15.118 0 01-2.972 3.748zM69.414 73l2.881-14.42c.328-1.688.208-2.942-.361-3.555-.57-.614-1.782-1.025-3.635-1.025h-5.79l-3.731 19h-7.244l6.515-33h7.244l-1.732 9h6.453c4.061 0 6.861.815 8.402 2.231s2.003 3.356 1.387 6.528L76.772 73h-7.358zm40.259-11.178c-.318 1.637-.856 3.133-1.613 4.488-.758 1.357-1.748 2.598-2.971 3.722-1.458 1.364-3.078 1.927-4.86 2.507-1.782.581-4.053.461-6.812.461h-6.253l-1.732 10h-7.301l6.514-34h14.041c4.224 0 7.305 1.215 9.241 3.432 1.935 2.217 2.518 5.418 1.746 9.39zM95.919 54h-5.001l-2.727 14h4.442c2.942 0 5.136-.29 6.576-1.4 1.442-1.108 2.413-2.828 2.918-5.421.484-2.491.264-4.434-.66-5.458-.925-1.024-2.774-1.721-5.548-1.721zm-56.985 0h-5.002l-2.727 14h4.441c2.943 0 5.136-.29 6.577-1.4 1.441-1.108 2.413-2.828 2.917-5.421.484-2.491.264-4.434-.66-5.458S41.708 54 38.934 54z"></path>
          </svg>
        </p>
        <div class="skill-body">
          <h3 class="skill-name">PHP</h3>
          <p class="skill-text">
            基礎知識を応用して、動的なWebページを作成することが出来ます。また、データベースへの接続やクエリ実行等のDB連携、メール送信等も可能です。
          </p>
        </div> 
      </div>
      <div class="skill-item fade-in">
        <p class="skill-img"><svg viewBox="0 0 128 128" width="70px" height="70px">
          <path fill="#FD4F31" d="M14.887 18.316l2.72 4.523 2.507 4.182c1.301 2.17 2.602 4.34 3.901 6.51l2.662 4.44 3.882 6.465 4.749 7.936c1.369 2.285 2.741 4.569 4.112 6.853l.184.267c.199.062.357.009.521-.03 1.807-.434 3.614-.865 5.421-1.296 2.931-.7 5.862-1.398 8.792-2.099l4.592-1.098c2.962-.708 5.926-1.414 8.889-2.124 2.996-.716 5.99-1.436 8.985-2.154 1.514-.363 3.028-.725 4.543-1.086l8.792-2.096 9.575-2.28.517-.14-.141-.28c-.869-1.232-1.742-2.462-2.613-3.693l-2.581-3.654-2.76-3.898-2.639-3.737-2.614-3.693-2.701-3.816-2.646-3.731-1.396-1.969a3.647 3.647 0 01-.497-.982c-.275-.856.039-1.425.538-1.846a3.018 3.018 0 011.1-.593 17.382 17.382 0 011.702-.432c1.151-.217 2.309-.402 3.465-.594 1.304-.217 2.609-.424 3.915-.639.825-.136 1.65-.279 2.476-.419l3.367-.567a927.64 927.64 0 013.269-.543l3.568-.583 2.477-.417c.94-.157 1.882-.314 2.823-.468 1.174-.191 2.346-.384 3.521-.568.698-.109 1.399-.148 2.093.052.521.151.994.395 1.436.706l.61.426c.061-.141-.027-.217-.067-.298a14.062 14.062 0 00-3.606-4.592 13.894 13.894 0 00-4.773-2.616c-1.04-.33-2.109-.483-3.199-.565l-.535-.08H24.561l-.429.069c-.954.075-1.892.217-2.815.47a13.74 13.74 0 00-5.401 2.885 13.768 13.768 0 00-2.435 2.727 13.743 13.743 0 00-2.156 5.189l.461.803c1.033 1.726 2.067 3.449 3.101 5.173zm5.241 87.825c.97.373 1.972.635 3.006.762l1.047.047c.163.021.32.05.48.05h32.288c-.052 0-.099-.149-.157-.25-1.271-2.168-2.554-4.296-3.81-6.472a1113.602 1113.602 0 01-4.705-8.233c-1.664-2.944-3.313-5.89-4.965-8.842a4986.932 4986.932 0 01-4.698-8.42c-.944-1.698-1.883-3.396-2.825-5.095l-.252-.388-.458.091c-.908.234-1.814.471-2.721.709-1.262.332-2.522.67-3.785 1-2.834.738-5.669 1.471-8.503 2.207-2.883.748-5.704 1.498-8.589 2.243-.175.046.519.062-.481.092v17.905c1 .104.136.294.158.477.066.53.085 1.064.179 1.59a13.427 13.427 0 002.224 5.378c1.664 2.392 3.852 4.103 6.567 5.149zm-6.122-40.39l10.008-2.377 4.396-1.039c.732-.174 1.468-.341 2.194-.537.646-.175.727-.389.394-.973-.481-.844-.97-1.682-1.458-2.522l-4.288-7.383-4.287-7.385-4.364-7.513-3.736-6.427-1.553-2.781c-.1-.17.689-.371-.311-.461v40.135c0-.027.204-.05.333-.081l2.672-.656zm102.671 28.688c-1.308.465-2.615.933-3.923 1.401a31869.44 31869.44 0 00-8.93 3.202c-1.652.593-3.304 1.193-4.959 1.784-3.371 1.204-6.744 2.403-10.117 3.604-1.955.696-3.91 1.325-5.863 2.024-.535.193-1.063.546-1.593.546h22.431l.484-.046a12.14 12.14 0 001.691-.181 13.742 13.742 0 006.191-2.815 13.962 13.962 0 003.438-4.016c.92-1.606 1.466-3.329 1.728-5.153.023-.157.072-.328-.06-.491-.184-.014-.349.08-.518.141zm-1.927-30.121c-.99-1.353-1.98-2.704-2.968-4.058-1.362-1.869-2.723-3.74-4.083-5.609-.553-.759-1.113-1.512-1.654-2.279-.162-.231-.348-.292-.601-.224l-.145.042-7.517 1.823-4.489 1.089-8.782 2.133-8.687 2.111c-3.01.729-6.02 1.456-9.028 2.186-2.961.719-5.921 1.44-8.881 2.16l-8.589 2.085c-1.513.367-3.025.733-4.537 1.103-.223.054-.463.067-.699.247l.202.385c1.268 2.19 2.535 4.379 3.806 6.567 1.438 2.478 2.878 4.955 4.321 7.43 1.587 2.72 3.178 5.439 4.768 8.159.913 1.562 1.821 3.127 2.742 4.685a543.92 543.92 0 003.094 5.178c.312.515.666 1.006 1.023 1.49.24.323.537.599.887.81.36.218.75.286 1.159.194.212-.048.419-.118.624-.189l.754-.279c2.74-.938 5.48-1.875 8.223-2.809 2.139-.729 4.28-1.453 6.421-2.177 2.125-.72 4.251-1.438 6.376-2.155l6.329-2.137c2.157-.729 4.314-1.458 6.471-2.189 2.647-.898 5.294-1.8 7.942-2.696 2.553-.864 5.107-1.723 7.662-2.584.156-.053.329-.075.459-.247l.016-.372c0-5.296-.001-10.594.006-15.891a1.16 1.16 0 00-.246-.738c-.801-1.077-1.588-2.162-2.379-3.244zm-.439-49.907c-.595-.753-1.352-.992-2.279-.75-.404.106-.819.172-1.23.248-1.351.247-2.701.49-4.052.735-1.976.359-3.951.722-5.928 1.077-1.564.282-3.131.558-4.696.833l-6.281 1.099c-.264.046-.53.092-.783.173-.37.119-.478.351-.309.699.139.284.311.556.497.812 1.298 1.79 2.604 3.576 3.908 5.362 1.798 2.463 3.598 4.926 5.397 7.388 1.522 2.083 3.046 4.166 4.57 6.248 1.197 1.637 2.395 3.272 3.593 4.908l.237.286c3.447-.853 6.889-1.703 10.39-2.568l.024-.538c0-7.208-.001-14.415.006-21.622 0-.318-.078-.574-.277-.826-.875-1.103-1.732-2.219-2.597-3.33l-.19-.234zm2.795 34.922c-1.572.377-3.149.737-4.759 1.163.171.303 4.585 6.262 4.842 6.544l.162.089.018-.363v-2.51c.002-1.455.006-2.911.002-4.366 0-.178.049-.367-.072-.547l-.193-.01zM12.93 127v-17.133h3.633V124h6.949v3H12.93zm24.047 0l-1.242-4.078h-6.246L28.246 127h-3.914l6.047-17.203h4.441L40.891 127h-3.914zm-2.11-7.125c-1.148-3.695-1.795-5.785-1.939-6.27s-.248-.867-.311-1.148c-.258 1-.996 3.473-2.215 7.418h4.465zm11.813.551V127h-3.633v-17.133h4.992c2.328 0 4.051.424 5.168 1.271s1.676 2.135 1.676 3.861c0 1.008-.277 1.904-.832 2.689s-1.34 1.4-2.355 1.846c2.578 3.852 4.258 6.34 5.039 7.465h-4.031l-4.09-6.574H46.68zm0-2.953h1.172c1.148 0 1.996-.191 2.543-.574s.82-.984.82-1.805c0-.812-.279-1.391-.838-1.734s-1.424-.516-2.596-.516H46.68v4.629zM69.379 127l-1.242-4.078h-6.246L60.648 127h-3.914l6.047-17.203h4.441L73.293 127h-3.914zm-2.109-7.125c-1.148-3.695-1.795-5.785-1.939-6.27s-.248-.867-.311-1.148c-.258 1-.996 3.473-2.215 7.418h4.465zm17.953-10.008h3.668L83.066 127h-3.961l-5.812-17.133h3.668l3.223 10.195c.18.602.365 1.303.557 2.104s.311 1.357.357 1.67c.086-.719.379-1.977.879-3.773l3.246-10.196zM100.914 127h-9.867v-17.133h9.867v2.977H94.68v3.762h5.801v2.977H94.68V124h6.234v3zm3.574 0v-17.133h3.633V124h6.949v3h-10.582z"></path>
          </svg>
        </p>
        <div class="skill-body">
          <h3 class="skill-name">Laravel</h3>
          <p class="skill-text">
            ルーティングやMVC各々の基礎理解、DBクラスやクエリビルダ、Eloquentを使用したDBとの連携が可能なレベルで、現在習得中です。
          </p>
        </div>
      </div>    
    </div>

    <div class="skill-container">
      <div class="skill-item fade-in">
        <p class="skill-img"><svg viewBox="0 0 128 128" width="70px" height="70px">
          <path fill="#0074BD" d="M52.581 67.817s-3.284 1.911 2.341 2.557c6.814.778 10.297.666 17.805-.753 0 0 1.979 1.237 4.735 2.309-16.836 7.213-38.104-.418-24.881-4.113zm-2.059-9.415s-3.684 2.729 1.945 3.311c7.28.751 13.027.813 22.979-1.103 0 0 1.373 1.396 3.536 2.157-20.352 5.954-43.021.469-28.46-4.365z"></path><path fill="#EA2D2E" d="M67.865 42.431c4.151 4.778-1.088 9.074-1.088 9.074s10.533-5.437 5.696-12.248c-4.519-6.349-7.982-9.502 10.771-20.378.001 0-29.438 7.35-15.379 23.552z"></path><path fill="#0074BD" d="M90.132 74.781s2.432 2.005-2.678 3.555c-9.716 2.943-40.444 3.831-48.979.117-3.066-1.335 2.687-3.187 4.496-3.576 1.887-.409 2.965-.334 2.965-.334-3.412-2.403-22.055 4.719-9.469 6.762 34.324 5.563 62.567-2.506 53.665-6.524zm-35.97-26.134s-15.629 3.713-5.534 5.063c4.264.57 12.758.439 20.676-.225 6.469-.543 12.961-1.704 12.961-1.704s-2.279.978-3.93 2.104c-15.874 4.175-46.533 2.23-37.706-2.038 7.463-3.611 13.533-3.2 13.533-3.2zM82.2 64.317c16.135-8.382 8.674-16.438 3.467-15.353-1.273.266-1.845.496-1.845.496s.475-.744 1.378-1.063c10.302-3.62 18.223 10.681-3.322 16.345 0 0 .247-.224.322-.425z"></path><path fill="#EA2D2E" d="M72.474 1.313s8.935 8.939-8.476 22.682c-13.962 11.027-3.184 17.313-.006 24.498-8.15-7.354-14.128-13.828-10.118-19.852 5.889-8.842 22.204-13.131 18.6-27.328z"></path><path fill="#0074BD" d="M55.749 87.039c15.484.99 39.269-.551 39.832-7.878 0 0-1.082 2.777-12.799 4.981-13.218 2.488-29.523 2.199-39.191.603 0 0 1.98 1.64 12.158 2.294z"></path><path fill="#EA2D2E" d="M94.866 100.181h-.472v-.264h1.27v.264h-.47v1.317h-.329l.001-1.317zm2.535.066h-.006l-.468 1.251h-.216l-.465-1.251h-.005v1.251h-.312v-1.581h.457l.431 1.119.432-1.119h.454v1.581h-.302v-1.251zm-44.19 14.79c-1.46 1.266-3.004 1.978-4.391 1.978-1.974 0-3.045-1.186-3.045-3.085 0-2.055 1.146-3.56 5.738-3.56h1.697v4.667h.001zm4.031 4.548v-14.077c0-3.599-2.053-5.973-6.997-5.973-2.886 0-5.416.714-7.473 1.622l.592 2.493c1.62-.595 3.715-1.147 5.771-1.147 2.85 0 4.075 1.147 4.075 3.521v1.779h-1.424c-6.921 0-10.044 2.685-10.044 6.723 0 3.479 2.058 5.456 5.933 5.456 2.49 0 4.351-1.028 6.088-2.533l.316 2.137h3.163v-.001zm13.452 0h-5.027l-6.051-19.689h4.391l3.756 12.099.835 3.635c1.896-5.258 3.24-10.596 3.912-15.733h4.271c-1.143 6.481-3.203 13.598-6.087 19.688zm19.288-4.548c-1.465 1.266-3.01 1.978-4.392 1.978-1.976 0-3.046-1.186-3.046-3.085 0-2.055 1.149-3.56 5.736-3.56h1.701v4.667h.001zm4.033 4.548v-14.077c0-3.599-2.059-5.973-6.999-5.973-2.889 0-5.418.714-7.475 1.622l.593 2.493c1.62-.595 3.718-1.147 5.774-1.147 2.846 0 4.074 1.147 4.074 3.521v1.779h-1.424c-6.923 0-10.045 2.685-10.045 6.723 0 3.479 2.056 5.456 5.93 5.456 2.491 0 4.349-1.028 6.091-2.533l.318 2.137h3.163v-.001zm-56.693 3.346c-1.147 1.679-3.005 3.008-5.037 3.757l-1.989-2.345c1.547-.794 2.872-2.075 3.489-3.269.532-1.063.753-2.43.753-5.701V92.891h4.284v22.173c0 4.375-.348 6.144-1.5 7.867z"></path>
          </svg>
        </p>
        <div class="skill-body">
          <h3 class="skill-name">Java</h3>
          <p class="skill-text">
            基本的な構文については習得しています。また、Eclipse環境下でスロット等の簡単なゲームの開発経験があります。
          </p>
        </div>
      </div>
      <div class="skill-item fade-in">
        <p class="skill-img"><svg viewBox="0 0 128 128" width="70px" height="70px">
          <path fill="#00618A" d="M116.948 97.807c-6.863-.187-12.104.452-16.585 2.341-1.273.537-3.305.552-3.513 2.147.7.733.809 1.829 1.365 2.731 1.07 1.73 2.876 4.052 4.488 5.268 1.762 1.33 3.577 2.751 5.465 3.902 3.358 2.047 7.107 3.217 10.34 5.268 1.906 1.21 3.799 2.733 5.658 4.097.92.675 1.537 1.724 2.732 2.147v-.194c-.628-.8-.79-1.898-1.366-2.733l-2.537-2.537c-2.48-3.292-5.629-6.184-8.976-8.585-2.669-1.916-8.642-4.504-9.755-7.609l-.195-.195c1.892-.214 4.107-.898 5.854-1.367 2.934-.786 5.556-.583 8.585-1.365l4.097-1.171v-.78c-1.531-1.571-2.623-3.651-4.292-5.073-4.37-3.72-9.138-7.437-14.048-10.537-2.724-1.718-6.089-2.835-8.976-4.292-.971-.491-2.677-.746-3.318-1.562-1.517-1.932-2.342-4.382-3.511-6.633-2.449-4.717-4.854-9.868-7.024-14.831-1.48-3.384-2.447-6.72-4.293-9.756-8.86-14.567-18.396-23.358-33.169-32-3.144-1.838-6.929-2.563-10.929-3.513-2.145-.129-4.292-.26-6.438-.391-1.311-.546-2.673-2.149-3.902-2.927C17.811 4.565 5.257-2.16 1.633 6.682c-2.289 5.581 3.421 11.025 5.462 13.854 1.434 1.982 3.269 4.207 4.293 6.438.674 1.467.79 2.938 1.367 4.489 1.417 3.822 2.652 7.98 4.487 11.511.927 1.788 1.949 3.67 3.122 5.268.718.981 1.951 1.413 2.145 2.927-1.204 1.686-1.273 4.304-1.95 6.44-3.05 9.615-1.899 21.567 2.537 28.683 1.36 2.186 4.567 6.871 8.975 5.073 3.856-1.57 2.995-6.438 4.098-10.732.249-.973.096-1.689.585-2.341v.195l3.513 7.024c2.6 4.187 7.212 8.562 11.122 11.514 2.027 1.531 3.623 4.177 6.244 5.073v-.196h-.195c-.508-.791-1.303-1.119-1.951-1.755-1.527-1.497-3.225-3.358-4.487-5.073-3.556-4.827-6.698-10.11-9.561-15.609-1.368-2.627-2.557-5.523-3.709-8.196-.444-1.03-.438-2.589-1.364-3.122-1.263 1.958-3.122 3.542-4.098 5.854-1.561 3.696-1.762 8.204-2.341 12.878-.342.122-.19.038-.391.194-2.718-.655-3.672-3.452-4.683-5.853-2.554-6.07-3.029-15.842-.781-22.829.582-1.809 3.21-7.501 2.146-9.172-.508-1.666-2.184-2.63-3.121-3.903-1.161-1.574-2.319-3.646-3.124-5.464-2.09-4.731-3.066-10.044-5.267-14.828-1.053-2.287-2.832-4.602-4.293-6.634-1.617-2.253-3.429-3.912-4.683-6.635-.446-.968-1.051-2.518-.391-3.513.21-.671.508-.951 1.171-1.17 1.132-.873 4.284.29 5.462.779 3.129 1.3 5.741 2.538 8.392 4.294 1.271.844 2.559 2.475 4.097 2.927h1.756c2.747.631 5.824.195 8.391.975 4.536 1.378 8.601 3.523 12.292 5.854 11.246 7.102 20.442 17.21 26.732 29.269 1.012 1.942 1.45 3.794 2.341 5.854 1.798 4.153 4.063 8.426 5.852 12.488 1.786 4.052 3.526 8.141 6.05 11.513 1.327 1.772 6.451 2.723 8.781 3.708 1.632.689 4.307 1.409 5.854 2.34 2.953 1.782 5.815 3.903 8.586 5.855 1.383.975 5.64 3.116 5.852 4.879zM29.729 23.466c-1.431-.027-2.443.156-3.513.389v.195h.195c.683 1.402 1.888 2.306 2.731 3.513.65 1.367 1.301 2.732 1.952 4.097l.194-.193c1.209-.853 1.762-2.214 1.755-4.294-.484-.509-.555-1.147-.975-1.755-.556-.811-1.635-1.272-2.339-1.952z"></path>
          </svg>
        </p>
        <div class="skill-body">
          <h3 class="skill-name">MySQL</h3>
          <p class="skill-text">
            テーブルの作成からレコードの検索、挿入、更新、削除等のCRUD処理が可能です。
          </p>
        </div> 
      </div>
    </div>
    
    <div class="skill-container">
      <div class="skill-item fade-in">
        <p class="skill-img"><svg fill="none" width="70px" height="70px"  xmlns="http://www.w3.org/2000/svg" viewBox="0.155 0 37.299 38"><g fill="#0085ca"><path d="M37.454 36.845V1.155C37.454.578 37 0 36.317 0H1.292C.61 0 .155.462.155 1.155v35.69C.155 37.423.61 38 1.292 38h35.025c.682 0 1.137-.578 1.137-1.155zm-1.478-.346H1.634V1.502h34.342z"/><path d="M14.37 30.84c5.117 0 8.415-2.889 8.415-10.396V7.739h-3.753V20.79c0 4.967-1.933 6.584-4.662 6.584s-4.435-1.617-4.435-6.584V7.854h-3.98V20.56c0 7.392 3.298 10.28 8.415 10.28zM29.835 10.857c1.365 0 2.388-.924 2.388-2.194 0-1.386-1.023-2.31-2.388-2.31s-2.388.924-2.388 2.31c0 1.27 1.024 2.194 2.388 2.194zM31.768 13.86h-3.866v16.98h3.866z"/></g></svg></p>
        <div class="skill-body">
          <h3 class="skill-name">UiPath</h3>
          <p class="skill-text">
            大手クライアント様にて、1年ほどの実務経験があります。主にWebページのスクレイピングからExcelへの転記、Excel形式の書類作成からメール送付までの一連の処理、社内システムへの情報入力等、定型的な事務作業の自動化が可能です。
          </p>
        </div>
      </div>
    </div>
  </div>
  <!-- /skill -->

  <!-- ABOUT -->
  <div class="about wrapper" id="about">
    <h2 class="title fade-in">ABOUT</h2>
    <div class="profile">
      <div class="image fade-in">
        <img class="profile-img" src="img/profile.jpg" alt=""> 
      </div>
      <div class="profile-info">
        <div class="info1 fade-in">
          <h3 class="profile-title">＜ プロフィール ＞</h3>
          <p class="career-text">名前：奥田 拓也</p>
          <p class="career-text">年齢：26歳</p>
          <p class="career-text">出身：島根県</p>
          <p class="career-text">居住地：島根県 ⇒ 岡山県（大学4年間）⇒ 東京都 神楽坂（現在）</p>
          <p class="career-text">趣味：スキー（インターハイ出場経験あり）、ギター、テレビゲーム、神楽坂周辺でカフェ巡り</p>
        </div>
        <div class="info2 fade-in">
          <h3 class="profile-title">＜ 自己PR ＞</h3>
          <p class="career-text">
            私の強みは主体性です。<br>
            前職の常駐先において、知識や技術力が不足していた当初は、急ぎ対応ではない簡単なエラーの修正やテストだけを任されていました。しかし、1日でも早くプロジェクトに貢献したいという思いから、不明点の質問や相談、細かい進捗報告等、自身の強みを発揮して行動を継続。その結果、アサインから3週間程度で開発やユーザー連絡等の業務を任せて頂き、早くからクライアントとの信頼を得ることが出来ました。今後も、この強みを活かして一人前のWebエンジニアになれるよう精進していきます。
          </p>
        </div>
      </div>
    </div>
  </div>
  <!-- /ABOUT -->
  
  <!-- CONTACT -->
  <div class="contact wrapper" id="contact">
    <h2 class="title fade-in">CONTACT</h2>
    <p class="fade-in">お問い合わせはフォームからお願い致します。</p>
    <p class="contact-check fade-in">すべて入力必須項目です。</p>
    <p class="contact-check fade-in">お問い合わせ内容は500字以内とします。</p>
    <form action="#contact" method="POST" class="contactForm fade-in">
      <table>
        <tbody>
          <tr>
            <th>お名前</th>
            <td>
              <input type="text" name="name" maxlength="40" value="<?php if(isset($_POST['name'])) {echo h($_POST['name']);} ?>">
              <?php if(isset($error['name']) && $error['name'] == 'blank'): ?>
                <p class="error">* この項目は必須項目です。</p>
              <?php endif; ?>
            </td>
          </tr>
          <tr>
            <th>メールアドレス</th>
            <td>
              <input type="email" name="email" maxlength="100" value="<?php if(isset($_POST['email'])) {echo h($_POST['email']);} ?>">
              <?php if(isset($error['email']) && $error['email'] == 'blank'): ?>
                <p class="error">* この項目は必須項目です。</p>
              <?php endif; ?>
            </td>
          </tr>
          <tr>
            <th>お問い合わせ内容</th>
            <td>
              <textarea rows="6" cols="60" name="message" maxlength="500"><?php if(isset($_POST['email'])) {echo h($_POST['message']);} ?></textarea>
              <?php if(isset($error['message']) && $error['message'] == 'blank'): ?>
                <p class="error">* この項目は必須項目です。</p>
              <?php endif; ?>
            </td>
          </tr>
        </tbody>
      </table>
      <input type="submit" name="check" id="button" value="確認画面へ">
    </form>
  </div>
  <!-- /CONTACT -->
  
  <!-- FOOTER -->
  <footer class="footer">
    <div class="copyright">&copy;2021 TAKUYA OKUDA. All Rights Reserved.</div>
  </footer>
  <!-- /FOOTER -->

  <!-- jQuery -->
  <script src="https://ajax.googleapis.com/ajax/libs/jquery/3.4.1/jquery.min.js"></script>    
  <script src="js/script.js"></script>
  <!-- /jQuery -->
</body>
</html>